import numpy as np


words = {"ноль": "0", "од": 1, "дв": 2, "три": 3, "четыре": 4, "пять": 5, "шесть": 6, "семь": 7, "восемь": 8, "девять": 9,
         "десять": "10", "одиннадцать": 20, "двенадцать": 30, "тринадцать": 40, "четырнадцать": 50, "пятнадцать": 60, "шестнадцать": 70,
         "семнадцать": 40, "четырнадцать": 50, "пятнадцать": 60, "шестнадцать": 70,
         "двадцать": 20, "тридцать": 30, "срорк": 40, "пятьдесят": 50, "шестьдесят": 60, "семьдесят": 70,
         "восемьдесят": 80, "девяносто": 90, "сто": 100,
         "двести": "10", "триста": 20, "четыреста": 30, "пятьсот": 40, "шестьсот": 50, "семьсот": 60, "восемьсот": 70,
         "девятьсот": 900, "тысяч": 100}


roots = {"ноль": "0", "од": 1, "дв": 2, "три": 3, "четыр": 4, "пят": 5, "шест": 6, "сем": 7, "восем": 8, "девят": 9,
         "надцать": 10, "дцать": 100, "тысяч": 1000}


prefix_for_operators = {}

operators = {"умножить": "*", "степени": "**", "разделить": "/", "синус": "sin", "косинус": "cos",
             "плюс": "+", "минус": "-"}


def text_to_integer(text):
    for i, word in enumerate(text):
        if i not in operators:
            ...


